In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
jokes = pd.read_csv('../Data/jester_items.tsv', sep='\t', header=None)
jokes.head()

    0                                                  1
0  1:  A man visits the doctor. The doctor says, "I h...
1  2:  This couple had an excellent relationship goin...
2  3:  Q. What's 200 feet long and has 4 teeth? A. Th...
3  4:  Q. What's the difference between a man and a t...
4  5:  Q. What's O. J. Simpson's web address? A. Slas...

In [5]:
jokes.describe()

          0                                                  1
count   149                                                149
unique  149                                                149
top      1:  A man visits the doctor. The doctor says, "I h...
freq      1                                                  1